//=============================================================================
//
// ビルボード処理 [billboard.h]
// Author : 西村　任弘
//
//=============================================================================
#ifndef _BILLBOARD_H_
#define _BILLBOARD_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_BILLBOARD		"data/TEXTURE/ロックオンace.png"	// 読み込むテクスチャファイル名
#define	BILLBOARD_SIZE_X		(20.0f)									// ビルボードの幅
#define	BILLBOARD_SIZE_Y		(20.0f)									// ビルボードの高さ
#define	RATE_REGIST				(0.075f)								// 抵抗係数
#define	RATE_REFRECT			(-0.90f)								// 反射係数


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBillboard(void);
void UninitBillboard(void);
void UpdateBillboard(void);
void DrawBillboard(void);

#endif
