//=============================================================================
//
// 地面処理 [field.h]
// Author : 西村　任弘
//
//=============================================================================
#ifndef _FIELD_H_
#define _FIELD_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_FIELD	"data/TEXTURE/background_front.png"	// 読み込むテクスチャファイル名
#define	TEXTURE_SPACE	"data/TEXTURE/kadai BG01.png"		// 読み込むテクスチャファイル名
#define	VALUE_MOVE_EFFECTBULLET	(80)
#define SCROLL_SPEED			(0.00105f)
#define SPACE_SCROLL_SPEED		(0.002f)


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);
#endif
